Repository: Painkiller56/PrusaSlicer
Catalog: resources/localization/sv.tmx
Source language: en
Languages: sv

source: This start procedure is inserted at the beginning, after any printer start gcode (and after any toolchange to this filament in case of multi-material printers). This is used to override settings for a specific filament. If PrusaSlicer detects M104, M109, M140 or M190 in your custom codes, such commands will not be prepended automatically so you're free to customize the order of heating commands and other custom actions. Note that you can use placeholder variables for all PrusaSlicer settings, so you can put a "M109 S[first_layer_temperature]" command wherever you want. If you have multiple extruders, the gcode is processed in extruder order.
sv: This start procedure is inserted at the beginning, after any printer start gkod (and after any toolchange to this filament in case of multi-material printers). This is used to override settings for a specific filament. If PrusaSlicer detects M104, M109, M140 or M190 in your custom codes, such commands will not be prepended automatically so you're free to customize the order of heating commands and other custom actions. Note that you can use placeholder variables for all PrusaSlicer settings, so you can put a "M109 S[first_layer_temperature]" command wherever you want. If you have multiple extruders, the gkod is processed in extruder order.

source: Color change G-code
sv: Färgbyte G-kod

source: This G-code will be used as a code for the color change
sv: Denna G-kod kommer att användas som en kod för färgbytet

source: This G-code will be used as a code for the pause print
sv: Denna G-kod kommer att användas som en kod för pausutskriften

source: This G-code will be used as a custom code
sv: Denna G-kod kommer att användas som en anpassad kod

source: The printer multiplexes filaments into a single hot end.
sv: Skrivaren multiplexerar filament till en enda varm ände.

source: Prime all printing extruders
sv: Grunda alla trycksprutmaskiner

source: If enabled, all printing extruders will be primed at the front edge of the print bed at the start of the print.
sv: Om det är aktiverat kommer alla extruderare att grundas i framkanten av utskriftsbädden i början av utskriften.

source: No sparse layers (EXPERIMENTAL)
sv: Inga glesa lager (EXPERIMENTELLT)

source: If enabled, the wipe tower will not be printed on layers with no toolchanges. On layers with a toolchange, extruder will travel downward to print the wipe tower. User is responsible for ensuring there is no collision with the print.
sv: Om det är aktiverat skrivs torkatornet inte ut på lager utan verktygsbyten. På lager med verktygsbyte kommer extrudern att färdas nedåt för att skriva ut torktornet. Användaren ansvarar för att det inte sker någon kollision med utskriften.

source: Slice gap closing radius
sv: Skär spaltens stängningsradie

source: Cracks smaller than 2x gap closing radius are being filled during the triangle mesh slicing. The gap closing operation may reduce the final print resolution, therefore it is advisable to keep the value reasonably low.
sv: Sprickor som är mindre än 2x spaltens stängningsradie fylls under triangelmaskningen. Spaltstängningsoperationen kan minska den slutliga utskriftsupplösningen, därför är det tillrådligt att hålla värdet rimligt lågt.

source: Slicing Mode
sv: Skivningsläge

source: Use "Even-odd" for 3DLabPrint airplane models. Use "Close holes" to close all holes in the model.
sv: Använd "Jämnt-udda" för 3DLabPrint-flygplansmodeller. Använd "Stäng hål" för att stänga alla hål i modellen.

source: Regular
sv: Regelbunden

source: Even-odd
sv: Jämnt-udda

source: Close holes
sv: Stäng hål

source: Generate support material
sv: Skapa stödmaterial

source: Enable support material generation.
sv: Aktivera generering av stödmaterial.

source: Auto generated supports
sv: Autogenererade stöder

source: If checked, supports will be generated automatically based on the overhang threshold value. If unchecked, supports will be generated inside the "Support Enforcer" volumes only.
sv: Om markerad, kommer stöd att genereras automatiskt baserat på överhängströskelvärdet. Om det inte är markerat kommer stöd endast att genereras i "Support Enforcer"-volymerna.

source: XY separation between an object and its support
sv: XY-separation mellan ett objekt och dess stöd

source: XY separation between an object and its support. If expressed as percentage (for example 50%), it will be calculated over external perimeter width.
sv: XY-separation mellan ett objekt och dess stöd. Om det uttrycks i procent (till exempel 50%), kommer det att beräknas över yttre omkretsbredd.

source: Pattern angle
sv: Mönstervinkel

source: Use this setting to rotate the support material pattern on the horizontal plane.
sv: Använd denna inställning för att rotera stödmaterialmönstret i horisontalplanet.

source: Only create support if it lies on a build plate. Don't create support on a print.
sv: Skapa bara stöd om det ligger på en byggplatta. Skapa inte stöd på en utskrift.

source: Top contact Z distance
sv: Toppkontakt Z-avstånd

source: 0 (soluble)
sv: 0 (löslig)

source: 0.1 (detachable)
sv: 0,1 (avtagbar)

source: 0.2 (detachable)
sv: 0,2 (avtagbar)

source: Bottom contact Z distance
sv: Bottenkontakt Z-avstånd

source: The vertical distance between the object top surface and the support material interface. If set to zero, support_material_contact_distance will be used for both top and bottom contact Z distances.
sv: Det vertikala avståndet mellan objektets övre yta och stödmaterialets gränssnitt. Om inställt på noll kommer support_material_contact_distance att användas för både topp- och bottenkontakt Z-avstånd.

source: Same as top
sv: Samma som toppen

source: Enforce support for the first
sv: Framtvinga stöd för den första

source: Generate support material for the specified number of layers counting from bottom, regardless of whether normal support material is enabled or not and regardless of any angle threshold. This is useful for getting more adhesion of objects having a very thin or poor footprint on the build plate.
sv: Generera stödmaterial för det angivna antalet lager räknat från botten, oavsett om normalt stödmaterial är aktiverat eller inte och oavsett eventuell vinkeltröskel. Detta är användbart för att få mer vidhäftning av föremål som har ett mycket tunt eller dåligt fotavtryck på byggplattan.

source: Enforce support for the first n layers
sv: Framtvinga stöd för de första n lagren

source: Support material/raft/skirt extruder
sv: Stödmaterial/flotte/kjolextruder

source: The extruder to use when printing support material, raft and skirt (1+, 0 to use the current extruder to minimize tool changes).
sv: Extrudern att använda vid utskrift av stödmaterial, flotte och kjol (1+, 0 för att använda nuvarande extruder för att minimera verktygsbyten).

source: Set this to a non-zero value to set a manual extrusion width for support material. If left zero, default extrusion width will be used if set, otherwise nozzle diameter will be used. If expressed as percentage (for example 90%) it will be computed over layer height.
sv: Ställ in detta på ett värde som inte är noll för att ställa in en manuell extruderingsbredd för stödmaterial. Om den lämnas noll kommer standard extruderingsbredd att användas om den är inställd, annars kommer munstycksdiametern att användas. Om det uttrycks i procent (till exempel 90%) kommer det att beräknas över lagerhöjden.

source: Interface loops
sv: Gränssnittsslingor

source: Cover the top contact layer of the supports with loops. Disabled by default.
sv: Täck det övre kontaktskiktet på stöden med öglor. Inaktiverad som standard.

source: Support material/raft interface extruder
sv: Stödmaterial/flotta gränssnitt extruder

source: The extruder to use when printing support material interface (1+, 0 to use the current extruder to minimize tool changes). This affects raft too.
sv: Extrudern som ska användas vid utskrift av stödmaterialgränssnitt (1+, 0 för att använda den aktuella extrudern för att minimera verktygsbyten). Detta påverkar också flotten.

source: Top interface layers
sv: Översta gränssnittsskikten

source: Number of interface layers to insert between the object(s) and support material.
sv: Antal gränssnittsskikt att infoga mellan objektet/objekten och stödmaterialet.

source: 0 (off)
sv: 0 (av)

source: 1 (light)
sv: 1 (ljus)

source: 2 (default)
sv: 2 (standard)

source: 3 (heavy)
sv: 3 (tung)

source: Bottom interface layers
sv: Nedre gränssnittsskikt

source: Number of interface layers to insert between the object(s) and support material. Set to -1 to use support_material_interface_layers
sv: Antal gränssnittsskikt att infoga mellan objektet/objekten och stödmaterialet. Ställ in på -1 för att använda support_material_interface_layers

source: Closing radius
sv: Stängningsradie

source: For snug supports, the support regions will be merged using morphological closing operation. Gaps smaller than the closing radius will be filled in.
sv: För täta stöd kommer stödområdena att slås samman med morfologisk stängningsoperation. Luckor som är mindre än stängningsradien kommer att fyllas i.

source: Interface pattern spacing
sv: Gränssnittsmönsteravstånd

source: Spacing between interface lines. Set zero to get a solid interface.
sv: Avstånd mellan gränssnittslinjer. Sätt noll för att få ett stabilt gränssnitt.

source: Speed for printing support material interface layers. If expressed as percentage (for example 50%) it will be calculated over support material speed.
sv: Hastighet för utskrift av gränssnittsskikt för stödmaterial. Om det uttrycks i procent (till exempel 50%) kommer det att beräknas över bärarmaterialets hastighet.

source: Pattern
sv: Mönster

source: Pattern used to generate support material.
sv: Mönster som används för att generera stödmaterial.

source: Rectilinear grid
sv: Rätlinjigt rutnät

source: Interface pattern
sv: Gränssnittsmönster

source: Pattern used to generate support material interface. Default pattern for non-soluble support interface is Rectilinear, while default pattern for soluble support interface is Concentric.
sv: Mönster som används för att generera gränssnitt för stödmaterial. Standardmönster för olösligt stödgränssnitt är rätlinjigt, medan standardmönster för lösligt stödgränssnitt är koncentriskt.

source: Pattern spacing
sv: Mönsteravstånd

source: Spacing between support material lines.
sv: Avstånd mellan stödmateriallinjer.

source: Speed for printing support material.
sv: Hastighet för utskrift av stödmaterial.

source: Style
sv: Stil

source: Style and shape of the support towers. Projecting the supports into a regular grid will create more stable supports, while snug support towers will save material and reduce object scarring.
sv: Stil och form på stödtornen. Att projicera stöden i ett vanligt galler kommer att skapa stabilare stöd, medan täta stödtorn sparar material och minskar ärrbildning på föremål.

source: Snug
sv: Ombonad

source: Synchronize with object layers
sv: Synkronisera med objektlager

source: Synchronize support layers with the object print layers. This is useful with multi-material printers, where the extruder switch is expensive.
sv: Synkronisera stödlager med objektets utskriftslager. Detta är användbart med multi-material skrivare, där extruder switch är dyr.

source: Overhang threshold
sv: Överhängströskel

source: Support material will not be generated for overhangs whose slope angle (90° = vertical) is above the given threshold. In other words, this value represent the most horizontal slope (measured from the horizontal plane) that you can print without support material. Set to zero for automatic detection (recommended).
sv: Stödmaterial kommer inte att genereras för överhäng vars lutningsvinkel (90° = vertikal) ligger över den givna tröskeln. Med andra ord representerar detta värde den mest horisontella lutningen (mätt från horisontalplanet) som du kan skriva ut utan stödmaterial. Ställ in på noll för automatisk detektering (rekommenderas).

source: With sheath around the support
sv: Med fodral runt stödet

source: Add a sheath (a single perimeter line) around the base support. This makes the support more reliable, but also more difficult to remove.
sv: Lägg till ett hölje (en enda perimeterlinje) runt basstödet. Detta gör stödet mer pålitligt, men också svårare att ta bort.

source: Nozzle temperature for layers after the first one. Set this to zero to disable temperature control commands in the output G-code.
sv: Munstyckstemperatur för lager efter det första. Ställ in detta på noll för att inaktivera temperaturkontrollkommandon i utgångens G-kod.

source: Nozzle temperature
sv: Munstyckstemperatur

source: Thick bridges
sv: Tjocka broar

source: If enabled, bridges are more reliable, can bridge longer distances, but may look worse. If disabled, bridges look better but are reliable just for shorter bridged distances.
sv: Om det är aktiverat är broar mer tillförlitliga, kan överbrygga längre sträckor, men kan se sämre ut. Om de är inaktiverade ser broar bättre ut men är tillförlitliga bara för kortare överbryggade avstånd.

source: Detect thin walls
sv: Upptäck tunna väggar

source: Detect single-width walls (parts where two extrusions don't fit and we need to collapse them into a single trace).
sv: Upptäck enkelbreddsväggar (delar där två profiler inte passar och vi måste kollapsa dem till ett enda spår).

source: Threads
sv: Trådar

source: Threads are used to parallelize long-running tasks. Optimal threads number is slightly above the number of available cores/processors.
sv: Trådar används för att parallellisera långvariga uppgifter. Optimalt antal trådar är något över antalet tillgängliga kärnor/processorer.

source: This custom code is inserted before every toolchange. Placeholder variables for all PrusaSlicer settings as well as {toolchange_z}, {previous_extruder} and {next_extruder} can be used. When a tool-changing command which changes to the correct extruder is included (such as T{next_extruder}), PrusaSlicer will emit no other such command. It is therefore possible to script custom behaviour both before and after the toolchange.
sv: Denna anpassade kod infogas före varje verktygsbyte. Platshållarvariabler för alla PrusaSlicer-inställningar samt {toolchange_z}, {previous_extruder} och {next_extruder} kan användas. När ett verktygsbyte-kommando som ändras till rätt extruder ingår (som T{next_extruder}), kommer PrusaSlicer inte att avge något annat sådant kommando. Det är därför möjligt att skripta anpassat beteende både före och efter verktygsbytet.

source: Set this to a non-zero value to set a manual extrusion width for infill for top surfaces. You may want to use thinner extrudates to fill all narrow regions and get a smoother finish. If left zero, default extrusion width will be used if set, otherwise nozzle diameter will be used. If expressed as percentage (for example 90%) it will be computed over layer height.
sv: Ställ in detta på ett värde som inte är noll för att ställa in en manuell extruderingsbredd för infill för toppytor. Du kanske vill använda tunnare extrudat för att fylla alla smala områden och få en jämnare finish. Om den lämnas noll kommer standard extruderingsbredd att användas om den är inställd, annars kommer munstycksdiametern att användas. Om det uttrycks i procent (till exempel 90%) kommer det att beräknas över lagerhöjden.

source: Speed for printing top solid layers (it only applies to the uppermost external layers and not to their internal solid layers). You may want to slow down this to get a nicer surface finish. This can be expressed as a percentage (for example: 80%) over the solid infill speed above. Set to zero for auto.
sv: Hastighet för utskrift av översta solida lager (den gäller endast de översta yttre lagren och inte deras inre solida lager). Du kanske vill bromsa detta för att få en snyggare ytfinish. Detta kan uttryckas som en procentandel (till exempel: 80 %) över den fasta fyllningshastigheten ovan. Ställ in på noll för auto.

source: Number of solid layers to generate on top surfaces.
sv: Antal solida lager som ska genereras på de övre ytorna.

source: Top solid layers
sv: Översta solida lager

source: The number of top solid layers is increased above top_solid_layers if necessary to satisfy minimum thickness of top shell. This is useful to prevent pillowing effect when printing with variable layer height.
sv: Antalet översta solida lager ökas över top_solid_layers om nödvändigt för att tillfredsställa minsta tjocklek på toppskalet. Detta är användbart för att förhindra kuddeffekt vid utskrift med variabel lagerhöjd.

source: Minimum top shell thickness
sv: Minsta övre skaltjocklek

source: Speed for travel moves (jumps between distant extrusion points).
sv: Hastighet för färdrörelser (hoppar mellan avlägsna extruderingspunkter).

source: Z travel
sv: Z resa

source: Speed for movements along the Z axis. When set to zero, the value is ignored and regular travel speed is used instead.
sv: Hastighet för rörelser längs Z-axeln. När det är nollställt ignoreras värdet och vanlig körhastighet används istället.

source: Use firmware retraction
sv: Använd indragning av firmware

source: This experimental setting uses G10 and G11 commands to have the firmware handle the retraction. This is only supported in recent Marlin.
sv: Denna experimentella inställning använder G10- och G11-kommandon för att få den fasta programvaran att hantera tillbakadragningen. Detta stöds bara i senaste Marlin.

source: Use relative E distances
sv: Använd relativa E-avstånd

source: If your firmware requires relative E values, check this, otherwise leave it unchecked. Most firmwares use absolute values.
sv: Om din firmware kräver relativa E-värden, kontrollera detta, annars lämna det omarkerat. De flesta firmware använder absoluta värden.

source: Use volumetric E
sv: Använd volymetrisk E

source: Enable variable layer height feature
sv: Aktivera funktionen för variabel lagerhöjd

source: Some printers or printer setups may have difficulties printing with a variable layer height. Enabled by default.
sv: Vissa skrivare eller skrivarinställningar kan ha svårigheter att skriva ut med en variabel lagerhöjd. Aktiverad som standard.

source: Wipe while retracting
sv: Torka medan du drar in

source: This flag will move the nozzle while retracting to minimize the possible blob on leaky extruders.
sv: Den här flaggan kommer att flytta munstycket samtidigt som det dras in för att minimera den möjliga fläcken på läckande extruderare.

source: Multi material printers may need to prime or purge extruders on tool changes. Extrude the excess material into the wipe tower.
sv: Flera material skrivare kan behöva grunda eller rensa extruders vid verktygsbyten. Extrudera överflödigt material i torktornet.

source: Purging volumes - load/unload volumes
sv: Rensningsvolymer - lastnings-/avlastningsvolymer

source: This vector saves required volumes to change from/to each tool used on the wipe tower. These values are used to simplify creation of the full purging volumes below.
sv: Denna vektor sparar nödvändiga volymer för att byta från/till varje verktyg som används på torkningstornet. Dessa värden används för att förenkla skapandet av de fullständiga reningsvolymerna nedan.

source: Purging volumes - matrix
sv: Rensningsvolymer - matris

source: This matrix describes volumes (in cubic milimetres) required to purge the new filament on the wipe tower for any given pair of tools.
sv: Denna matris beskriver volymer (i kubikmilimeter) som krävs för att rensa den nya filamenten på torktornet för ett givet verktygspar.

source: X coordinate of the left front corner of a wipe tower
sv: X-koordinat för det vänstra främre hörnet på ett torntorn

source: Y coordinate of the left front corner of a wipe tower
sv: Y-koordinat för det vänstra främre hörnet på ett torntorn

source: Width of a wipe tower
sv: Bredden på ett torntorn

source: Wipe tower rotation angle
sv: Torka av tornets rotationsvinkel

source: Wipe tower rotation angle with respect to x-axis.
sv: Torka av tornets rotationsvinkel med avseende på x-axeln.

source: Wipe tower brim width
sv: Torka av tornets brättebredd

source: Wipe into this object's infill
sv: Torka in i detta objekts infill

source: Purging after toolchange will be done inside this object's infills. This lowers the amount of waste but may result in longer print time due to additional travel moves.
sv: Rensning efter verktygsbyte kommer att göras inuti detta objekts fyllningar. Detta minskar mängden avfall men kan resultera i längre utskriftstid på grund av ytterligare resor.

source: Wipe into this object
sv: Torka in i detta föremål

source: Object will be used to purge the nozzle after a toolchange to save material that would otherwise end up in the wipe tower and decrease print time. Colours of the objects will be mixed as a result.
sv: Objektet kommer att användas för att rensa munstycket efter ett verktygsbyte för att spara material som annars skulle hamna i torktornet och minska utskriftstiden. Färgerna på föremålen kommer att blandas som ett resultat.

source: Maximal bridging distance
sv: Maximalt överbryggningsavstånd

source: Maximal distance between supports on sparse infill sections.
sv: Maximalt avstånd mellan stöden på glesa utfyllnadssektioner.

source: XY Size Compensation
sv: XY Storlekskompensation

source: The object will be grown/shrunk in the XY plane by the configured value (negative = inwards, positive = outwards). This might be useful for fine-tuning hole sizes.
sv: Objektet kommer att växa/krympas i XY-planet med det konfigurerade värdet (negativt = inåt, positivt = utåt). Detta kan vara användbart för att finjustera hålstorlekar.

source: This value will be added (or subtracted) from all the Z coordinates in the output G-code. It is used to compensate for bad Z endstop position: for example, if your endstop zero actually leaves the nozzle 0.3mm far from the print bed, set this to -0.3 (or fix your endstop).
sv: Detta värde kommer att adderas (eller subtraheras) från alla Z-koordinater i den utgående G-koden. Den används för att kompensera för dåligt Z-ändstoppsläge: till exempel, om din ändstoppsnolla faktiskt lämnar munstycket 0,3 mm långt från utskriftsbädden, ställ in detta på -0,3 (eller fixera ditt ändstopp).

source: Display width
sv: Displayens bredd

source: Width of the display
sv: Displayens bredd

source: Display height
sv: Displayhöjd

source: Height of the display
sv: Displayens höjd

source: Number of pixels in
sv: Antal pixlar in

source: Number of pixels in X
sv: Antal pixlar i X

source: Number of pixels in Y
sv: Antal pixlar i Y

source: Display horizontal mirroring
sv: Visa horisontell spegling

source: Mirror horizontally
sv: Spegel horisontellt

source: Enable horizontal mirroring of output images
sv: Aktivera horisontell spegling av utgående bilder

source: Display vertical mirroring
sv: Visa vertikal spegling

source: Mirror vertically
sv: Spegel vertikalt

source: Enable vertical mirroring of output images
sv: Aktivera vertikal spegling av utgående bilder

source: Display orientation
sv: Visa orientering

source: Set the actual LCD display orientation inside the SLA printer. Portrait mode will flip the meaning of display width and height parameters and the output images will be rotated by 90 degrees.
sv: Ställ in den faktiska LCD-skärmens orientering inuti SLA-skrivaren. Porträttläget kommer att vända innebörden av skärmbredds- och höjdparametrar och de utgående bilderna kommer att roteras 90 grader.

source: Landscape
sv: Landskap

source: Portrait
sv: Porträtt

source: Fast
sv: Snabb

source: Fast tilt
sv: Snabb lutning

source: Time of the fast tilt
sv: Tid för snabb tilt

source: Slow
sv: Långsam

source: Slow tilt
sv: Långsam lutning

source: Time of the slow tilt
sv: Tiden för den långsamma lutningen
